{
  "text_cz": "<p>\nProblém obchodního cestujícího je možné řešit tak, že změříme délku\nvšech možných cest a z nich vybereme tu nejkratší. Tato metoda\n(vyzkoušet všechny možnosti) se označuje jako řešení problému hrubou\nsílou. Počet těchto cest však s rostoucím počtem měst velmi rychle\nroste. Např. pro 5 měst dostaneme 12 možných cest, pro 10 měst již 181\n440 cest a pro 28 měst (hlavní města všech států EU - rok 2014)\ndostaneme neuvěřitelných <br \\/>5 444 434 725 209 176 080 384 000 000\nmožných cest. Vyzkoušet všechny možné cesty by i nejrychlejšímu\npočítači na světě zabralo miliony let.\n</p>\n<p>\nPro problém obchodního cestujícího neznáme způsob řešení, který by v\nprincipu byl efektivnější než hrubá síla. V reálném životě (například\npři plánování trasy dodávky rozvážející balíky) se proto využívají\ntzv. heuristiky. To jsou metody, které sice nemusí najít cestu, která\nje úplně nejkratší, ale zato ji najdou rychle.\n</p>\n<p>\nProblémem na první pohled velmi podobným problému obchodního\ncestujícího je hledání tzv. Eulerovského tahu. Eulerovský tah prochází\nkaždou spojnicí mezi městy právě jednou. Jednotlivá města lze přitom\nnavštívit i vícekrát. V praxi se s ním setkáme při plánování tras\nsněžných pluhů, sypačů či popelářů, kteří musí projet každou silnici\n(projíždět silnici opakovaně přitom nemá smysl). Na rozdíl od problému\nobchodního cestujícího lze nejkratší Eulerovský tah najít spolehlivě a\npoměrně rychle.\n</p>\n<p>\nVěděli jste, že čmelák během letu z květiny na květinu a sběru pylu\ntaké řeší úlohu známou jako problém obchodního cestujícího? Během\nněkolika desítek pokusů byl pozorovaný čmelák schopen zkrátit délku\nsvého letu na jednu pětinu původní hodnoty. Jeho řešení nebylo to\nnejlepší možné, nicméně pro čmeláka je důležité rychle najít rozumně\nkrátkou cestu a začít se sběrem.\n</p>",
  "text_en": "<p>The Travelling Salesman Problem may be resolved by measuring the length of all possible routes and choosing the shortest one. This method (trying all alternatives) is called the brute force solution. The number of routes, however, grows very fast as the number of towns increases. For example, there are 12 possible routes for 5 towns, 181,440 routes for 10 towns and an unbelievable 5,444,434,725,209,176,080,384,000,000 possible routes for 28 towns (the number of capital cities of all EU member states as of 2014). Trying all possible routes would take millions of years even with the fastest computer in the world.</p><p>There is no solution known for the Travelling Salesman Problem that would be basically more effective than the brute force method. Therefore, heuristics are used in real life (for example, while planning the route for a lorry transporting parcels). These methods may not find the shortest route, but they are capable of finding a good alternative quickly.</p><p>A problem that is very similar to the Travelling Salesman Problem at first sight is searching for the Eulerian path. The Eulerian path goes through every connecting route between the towns only once, although the towns can be visited several times. In practice, this method can be encountered when planning routes for snow ploughs and trash collectors that have to go on every road (taking a road repeatedly makes no sense). In contrast to the Travelling Salesman Problem, the shortest Eulerian path can be found reliably and quite quickly.</p><p>Did you know that a bumblebee solves the task known to humans as the Travelling Salesman Problem when flying from one flower to another? Over several experiments, an examined bumblebee was able to shorten the length of its flight to one-fifth its original length. Its solution was not the best possible one, but what is important to the bumblebee is to quickly find a reasonably short track and start collecting pollen.</p>",
  "text_de": "<p>Das Problem des Handelsreisenden kann so gelöst werden, dass wir die Länge aller möglichen Wege messen und aus diesen den kürzesten auswählen. Diese Methode einer Problemlösung (alle Möglichkeiten auszuprobieren) wird als Brute-Force-Methode (rohe Gewalt) bezeichnet. Die Zahl dieser Wege steigt jedoch mit einer wachsenden Zahl von Städten sehr schnell an. Z. B. für 5 Städte erhalten wir 12 mögliche Wege, für 10 Städte bereits 181 440 und für 28 Städte (die Hauptstädte aller EU-Staaten - Jahr 2014) erhalten wir unglaubliche 5 444 434 725 209 176 080 384 000 000 mögliche Wege. Alle möglichen Wege auszuprobieren, würde auch beim schnellsten Rechner der Welt Millionen von Jahren dauern.</p><p>Für das Problem des Handelsreisenden kennen wir keine Lösungsmethode, die im Prinzip effektiver wäre als die rohe Gewalt. Im realen Leben (zum Beispiel bei der Planung der Strecke eines Pakete ausfahrenden Lieferwagens) werden deshalb sog. heuristische Verfahren genutzt. Dies sind Methoden, die zwar nicht den Weg finden müssen, der der absolut kürzeste ist, aber dafür finden sie schnell einen.</p><p>Ein Problem, das auf den ersten Blick dem Problem des Handelsreisenden sehr ähnlich ist, ist die Suche des sog. Eulerkreises oder Eulerzugs. Der Eulerkreis durchläuft jede Verbindungslinie zwischen den Städten genau einmal. Die einzelnen Städte können dabei auch mehrmals besucht werden. In der Praxis begegnen wir dem bei der Streckenplanung von Schneepflügen, Streufahrzeugen oder Müllfahrzeugen, die durch jede Straße fahren müssen (eine Straße wiederholt zu durchfahren, hat dabei keinen Sinn). Im Unterschied zum Problem des Handelsreisenden, lässt sich der kürzeste Eulerkreis zuverlässig und relativ schnell finden.</p><p>Wusstet ihr, dass eine Hummel während des Flugs von Blüte zu Blüte und der Sammlung von Blütenstaub eine Aufgabe löst, die dem Menschen als Problem des Handelsreisenden bekannt ist? Während mehrerer Dutzend Versuche war die beobachtete Hummel in der Lage, die Länge ihres Flugs auf ein Fünftel des ursprünglichen Werts zu verkürzen. Ihre Lösung war nicht die bestmögliche, nichtsdestotrotz ist es für die Hummel wichtig, schnell einen vernünftig kurzen Weg zu finden und mit dem Sammeln zu beginnen.</p>"
}
